app/Controllers/Customer.php

    public function save()
    {
        $model = new CustomerModel();
        $model->insert([
            'name'    => $this->request->getPost('name'),
            'email'   => $this->request->getPost('email'),
            'phone'   => $this->request->getPost('phone'),
            'address' => $this->request->getPost('address'),
        ]);
---
INSERT INTO `customers` (`name`, `email`, `phone`, `address`) VALUES ('spandana', 'dal:JC;alDJ@gmail.com', '482974632', 'ajscjdcad')

    public function list()
    {
        $model = new CustomerModel();
        $data['customers'] = $model->findAll();
---
SELECT *
FROM `customers`